[
  {
    "company": "Cardano Risk Management",
    "companyUrl": "https://www.cardano.co.uk/",
    "city": "London",
    "role": "Full-stack Javascript Developer",
    "from": "Jan 2019",
    "to": "Dec 2019",
    "description": "Working at Cardano was an incredible and humbling experience, getting to work with some incredible minds building out highly complex software to help make important financial decisions. Testing became second nature, with critical peer reviewed pull requests as the standard. I learned a phenomenal amount from the team, both technical and non-technical, about requirement gathering, proposing architecture, establishing CI/CD pipelines and definitions of done before the developing and testing could even begin."
  },
  {
    "company": "Sparta Global",
    "companyUrl": "https://www.spartaglobal.com/",
    "city": "London",
    "role": "Technical Trainer",
    "from": "Nov 2017",
    "to": "Jan 2019",
    "description": "Sparta Global was where I discovered my love of teaching. Working as part of a small but dedicated team of technical and business trainers, Sparta helped to give individuals from all walks of life the technical tools to thrive in the industry. On top of the technical aspects of the training (like front-end, back-end, testing and DevOps)"
  },
  {
    "company": "WCRS",
    "companyUrl": "https://enginegroup.com",
    "city": "London",
    "role": "Front-end Developer",
    "from": "July 2017",
    "to": "Oct 2017",
    "description": "This was my first role out of the General Assembly coding bootcamp and was a peculiar one: while WCRS is an international digitcal advertising company, the team I worked in was isolated from the rest of the company due to the sensitive nature of the team's exclusive client, Apple. The role was making front-end fixes for their European sites in the run-up to the release of the iPhones X and 8 in 2017 and included a trip to Silicon Valley for the launch itself."
  },
  {
    "company": "Freelance",
    "companyUrl": "",
    "city": "London",
    "role": "Full-stack Javascript Developer",
    "from": "Jun 2017",
    "to": "",
    "description": "I'm constantly working on something, and since I started I've built the social platform MVP for The Circle of Intrapreneurs, a landing page for Killing Eve and various small-scale e-commerce platforms. And the occasional game 😀"
  }
]
